Revit 2015 API
CameraInfo Class
 An object holding information about the projection mapping of a 3D view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public class CameraInfo : IDisposable
Visual Basic
Public Class CameraInfo _
	Implements IDisposable
Visual C++
public ref class CameraInfo : IDisposable
Remarks
 CameraInfo can be obtained from a ViewNode. If camera is not available, orthographic view should be assumed.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CameraInfo
See Also
CameraInfo Members
Autodesk.Revit.DB Namespace